# Вывести на экран привет мир
# print('Привет, мир!')

# Дано 2 числа найти сумму
num_1 = 5
num_2 = 7
result = num_1 + num_2
print(result)
